/*

Copyright (C) 2019 - 2021 Superfury

This file is part of The Common Emulator Framework.

The Common Emulator Framework is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

The Common Emulator Framework is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with The Common Emulator Framework.  If not, see <https://www.gnu.org/licenses/>.
*/

#include "headers/types.h"
#include "headers/emu/input.h" //Own typedefs.
#include "headers/bios/bios.h" //BIOS Settings for keyboard input!
#include "headers/support/zalloc.h" //Zero allocation support for mouse packets!
#include "headers/emu/gpu/gpu_emu.h" //GPU emulator color support!
#include "headers/emu/gpu/gpu_sdl.h" //GPU SDL support!
#include "headers/emu/gpu/gpu_text.h" //GPU text layer support!
#include "headers/support/log.h" //Logging support!
#include "headers/support/highrestimer.h" //High resolution timer support!
#ifdef UNIPCEMU
#include "headers/hardware/sermouse.h" //Serial mouse support!
#endif
#include "headers/support/signedness.h" //Signedness support!
#ifdef UNIPCEMU

	SDLK_PAGEDOWN, //PG DN
	SDLK_UP, //U ARROW
	SDLK_LEFT, //L ARROW
	SDLK_DOWN, //D ARROW
	SDLK_RIGHT, //R ARROW

#ifndef SDL2//#ifdef SDL2
	SDLK_NUMLOCKCLEAR, //NUM
#else
	SDLK_NUMLOCK, //NUM
#endif
	SDLK_KP_DIVIDE, //KP /
	SDLK_KP_MULTIPLY, //KP *
	SDLK_KP_MINUS, //KP -
	SDLK_KP_PLUS, //KP +
	SDLK_KP_ENTER, //KP EN
	SDLK_KP_PERIOD, //KP .

#ifndef SDL2//#ifdef SDL2
	SDLK_KP_0, //KP 0
	SDLK_KP_1, //KP 1
	SDLK_KP_2, //KP 2
	SDLK_KP_3, //KP 3
	SDLK_KP_4, //KP 4
	SDLK_KP_5, //KP 5
	SDLK_KP_6, //KP 6
	SDLK_KP_7, //KP 7
	SDLK_KP_8, //KP 8
	SDLK_KP_9, //KP 9
#else
	SDLK_KP0, //KP 0
	SDLK_KP1, //KP 1
	SDLK_KP2, //KP 2
	SDLK_KP3, //KP 3
	SDLK_KP4, //KP 4
	SDLK_KP5, //KP 5
	SDLK_KP6, //KP 6
	SDLK_KP7, //KP 7
	SDLK_KP8, //KP 8
	SDLK_KP9, //KP 9
#endif

	SDLK_RIGHTBRACKET, //]
	SDLK_SEMICOLON, //;
	SDLK_QUOTE, //'
	SDLK_COMMA, //,
	SDLK_PERIOD, //.
	SDLK_SLASH  ///
};

#ifdef SDL2//#ifndef SDL2
int emu_keys_sdl_rev[UINT16_MAX+1]; //Reverse of emu_keys_sdl!
#else
//SDL 2.0 variant, without lookup table, but as fast as possible!
int emu_keys_sdl_rev(uint_32 key)
{
	switch (key) //What key?
	{
	case SDLK_a: return 0x00; //A
	case SDLK_b: return 0x01; //B
	case SDLK_c: return 0x02; //C
	case SDLK_d: return 0x03; //D
	case SDLK_e: return 0x04; //E
	case SDLK_f: return 0x05; //F
	case SDLK_g: return 0x06; //G
	case SDLK_h: return 0x07; //H
	case SDLK_i: return 0x08; //I
	case SDLK_j: return 0x09; //J
	case SDLK_k: return 0x0A; //K
	case SDLK_l: return 0x0B; //L
	case SDLK_m: return 0x0C; //M
	case SDLK_n: return 0x0D; //N
	case SDLK_o: return 0x0E; //O
	case SDLK_p: return 0x0F; //P
	case SDLK_q: return 0x10; //Q
	case SDLK_r: return 0x11; //R
	case SDLK_s: return 0x12; //S
	case SDLK_t: return 0x13; //T
	case SDLK_u: return 0x14; //U
	case SDLK_v: return 0x15; //V
	case SDLK_w: return 0x16; //W
	case SDLK_x: return 0x17; //X
	case SDLK_y: return 0x18; //Y
	case SDLK_z: return 0x19; //Z

	case SDLK_0: return 0x1A; //0
	case SDLK_1: return 0x1B; //1
	case SDLK_2: return 0x1C; //2
	case SDLK_3: return 0x1D; //3
	case SDLK_4: return 0x1E; //4
	case SDLK_5: return 0x1F; //5
	case SDLK_6: return 0x20; //6
	case SDLK_7: return 0x21; //7
	case SDLK_8: return 0x22; //8
	case SDLK_9: return 0x23; //9

	//Column 2! (above '9' included)
	case SDLK_BACKQUOTE: return 0x24; //`
	case SDLK_MINUS: return 0x25; //-
	case SDLK_EQUALS: return 0x26; //=
	case SDLK_BACKSLASH: return 0x27; //BACKSLASH

	case SDLK_BACKSPACE: return 0x28; //BKSP
	case SDLK_SPACE: return 0x29; //SPACE
	case SDLK_TAB: return 0x2A; //TAB
	case SDLK_CAPSLOCK: return 0x2B; //CAPS

	case SDLK_LSHIFT: return 0x2C; //L SHFT
	case SDLK_LCTRL: return 0x2D; //L CTRL
	case SDLK_LGUI: return 0x2E; //L WIN
	case SDLK_LALT: return 0x2F; //L ALT
	case SDLK_RSHIFT: return 0x30; //R SHFT
	case SDLK_RCTRL: return 0x31; //R CTRL
	case SDLK_RGUI: return 0x32; //R WIN
	case SDLK_RALT: return 0x33; //R ALT

	case SDLK_APPLICATION: return 0x34; //APPS
	case SDLK_RETURN: return 0x35; //ENTER
	case SDLK_ESCAPE: return 0x36; //ESC

	case SDLK_F1: return 0x37; //F1
	case SDLK_F2: return 0x38; //F2
	case SDLK_F3: return 0x39; //F3
	case SDLK_F4: return 0x3A; //F4
	case SDLK_F5: return 0x3B; //F5
	case SDLK_F6: return 0x3C; //F6
	case SDLK_F7: return 0x3D; //F7
	case SDLK_F8: return 0x3E; //F8
	case SDLK_F9: return 0x3F; //F9
	case SDLK_F10: return 0x40; //F10
	case SDLK_F11: return 0x41; //F11
	case SDLK_F12: return 0x42; //F12

	case SDLK_SYSREQ: return 0x43; //PRNT SCRN

	case SDLK_SCROLLLOCK: return 0x44; //SCROLL
	case SDLK_PAUSE: return 0x45; //PAUSE

	//Column 3!
	case SDLK_LEFTBRACKET: return 0x46; //[

	case SDLK_INSERT: return 0x47; //INSERT
	case SDLK_HOME: return 0x48; //HOME
	case SDLK_PAGEUP: return 0x49; //PG UP
	case SDLK_DELETE: return 0x4A; //DELETE
	case SDLK_END: return 0x4B; //END
	case SDLK_PAGEDOWN: return 0x4C; //PG DN
	case SDLK_UP: return 0x4D; //U ARROW
	case SDLK_LEFT: return 0x4E; //L ARROW
	case SDLK_DOWN: return 0x4F; //D ARROW
	case SDLK_RIGHT: return 0x50; //R ARROW

	case SDLK_NUMLOCKCLEAR: return 0x51; //NUM
	case SDLK_KP_DIVIDE: return 0x52; //KP /
	case SDLK_KP_MULTIPLY: return 0x53; //KP *
	case SDLK_KP_MINUS: return 0x54; //KP -
	case SDLK_KP_PLUS: return 0x55; //KP +
	case SDLK_KP_ENTER: return 0x56; //KP EN
	case SDLK_KP_PERIOD: return 0x57; //KP .

	case SDLK_KP_0: return 0x58; //KP 0
	case SDLK_KP_1: return 0x59; //KP 1
