/*

Copyright (C) 2019 - 2021 Superfury

This file is part of UniPCemu.

UniPCemu is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

UniPCemu is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with UniPCemu.  If not, see <https://www.gnu.org/licenses/>.
*/

#include "headers/types.h" //Basic type support!
#include "headers/hardware/pic.h" //Basic data!
#include "headers/hardware/ports.h" //Port support!
#include "headers/mmu/mmuhandler.h" //Basic MMU handler support!
#include "headers/cpu/cpu.h" //Emulated CPU support!

//PIC Info: http://www.brokenthorn.com/Resources/OSDevPic.html

//Are we disabled?
#define __HW_DISABLED 0

#define DELIVERYPENDING (1<<12)
#define REMOTEPENDING (1<<14)

byte numemulatedcpus = 1; //Amount of emulated CPUs!

PIC i8259;
byte irr3_dirty = 0; //IRR3/IRR3_a is changed?

struct
{
	sbyte enabled; //Enabled? -1=CPU disabled, 0=Soft disable, 1=Enabled
	//Basic information?
	word needstermination; //APIC needs termination?
	//CPU MSR information!
	uint_32 windowMSRlo;
	uint_32 windowMSRhi; //Window register that's written in the CPU!
	//Runtime information!
	uint_64 baseaddr; //Base address of the APIC!
	//Remaining variables? All memory that's stored in the APIC!

	//Differential detection
	uint_32 prevSpuriousInterruptVectorRegister; //The previous value before the write!
	uint_64 LAPIC_timerremainder; //How much time remained?
	byte LAPIC_timerdivider; //The divider of the timer!

	//Now, the actual memory for the LAPIC!
	byte LAPIC_requirestermination[0x400]; //Dword requires termination?
	byte LAPIC_globalrequirestermination; //Is termination required at all for the Local APIC?
	uint_32 LAPIC_arbitrationIDregister; //Arbitration ID, set at INIT deassert and RESET!
	uint_32 LAPIC_ID; //0020
	uint_32 LAPIC_version; //0030
	uint_32 TaskPriorityRegister; //0080
	uint_32 ArbitrationPriorityRegister; //0090
	uint_32 ProcessorPriorityRegister; //00A0
	uint_32 EOIregister; //00B0
	uint_32 RemoteReadRegister; //00C0
	uint_32 LogicalDestinationRegister; //00D0
	uint_32 DestinationFormatRegister; //00E0
	uint_32 SpuriousInterruptVectorRegister; //00F0
	uint_32 ISR[8]; //ISRs! 0100-0170
	uint_32 TMR[8]; //TMRs! 0180-01F0
	uint_32 IRR[8]; //IRRs! 0200-0270
	uint_32 ErrorStatusRegister; //0280
	uint_32 LVTCorrectedMachineCheckInterruptRegister; //02F0
	uint_32 InterruptCommandRegisterLo; //0300
	uint_32 InterruptCommandRegisterHi; //0310
	uint_32 LVTTimerRegister; //0320
	byte LVTTimerRegisterDirty;
	uint_32 LVTThermalSensorRegister; //0330
	uint_32 LVTPerformanceMonitoringCounterRegister; //0340
	uint_32 LVTLINT0Register; //0350. Connected to PIC master.
	byte LVTLINT0RegisterDirty;
	uint_32 LVTLINT1Register; //0560. Connectd to NMI pin.
	byte LVTLINT1RegisterDirty;
	uint_32 LVTErrorRegister; //0370
	byte LVTErrorRegisterDirty;
	uint_32 InitialCountRegister; //0380
	uint_32 CurrentCountRegister; //0390
	uint_32 DivideConfigurationRegister; //03E0

	uint_32 CurrentCountRegisterlatched; //Latched timer!
	byte CurrentCountRegisterTicking; //Is the count register ticking now?
	sword LAPIC_extIntPending;
	uint_32 errorstatusregisterpending; //Pending bits in the error status register!

	//Bookkeeping of the sending packet to various APICs pending!
	uint_32 InterruptCommandRegisterPendingReceiver; //Receivers still pending receiving!
	uint_32 InterruptCommandRegisterPendingIOAPIC; //IO APIC still pending receiving!
	uint_32 InterruptCommandRegisterReceivers; //What receivers have been determined?
	byte InterruptCommandRegisterReceiversDetermined; //Receivers have been determined?
} LAPIC[MAXCPUS]; //The Local APIC that's emulated!

byte lastLAPICAccepted[MAXCPUS]; //Last APIC accepted LVT result!
byte discardErrorTriggerResult[MAXCPUS]; //Discarded error trigger result!

struct
{
	byte enabled; //Enabled?
	//Basic information?
	word needstermination; //APIC needs termination?
